public/man/man1/hid2hci.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - hid2hci.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - hid2hci.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>hid2hci - Bluetooth HID to HCI mode switching utility</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>hid2hci</strong> [/OPTIONS/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>hid2hci(1)</strong> is used to set up switch supported Bluetooth devices into
the HCI mode and back.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<blockquote>
<ul>
<li><strong>–mode=[/mode/] Sets the mode to the device into. The possible
values</strong> :: for <em>mode</em> are <strong>hid</strong>, <strong>hci</strong>.</li>
<li><strong>–method=[/method/] Which vendor method to use for switching the
device.</strong> :: The possible values for <em>method</em> are <strong>csr</strong>, <strong>csr2</strong>,
<strong>logitech-hdi</strong>, <strong>dell</strong>.</li>
</ul>
</blockquote>
<blockquote>
<dl>
<dt>
<strong>–devpath</strong>
</dt>
<dd>Specifies the device path in /sys</dd>
<dt>
<strong>–help</strong>
</dt>
<dd>Gives a list of possible options.</dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
RESOURCES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>&lt;http://www.bluez.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
REPORTING BUGS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>&lt;linux-bluetooth@vger.kernel.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
AUTHOR
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>Marcel Holtmann &lt;marcel@holtmann.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
COPYRIGHT
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>Free use of this software is granted under ther terms of the GNU Lesser
General Public Licenses (LGPL).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
